##    ## ПРИКЛАДНЫЕ РЕШЕНИЯ ДЛЯ ПОДДЕРЖКИ КОДА##

## GitHub - это сервис (репозиторий),где хранится документация и код проекта.##

## Git - это контроль версий

## GitHub - онлайн пространство для взаимодействия участников проекта.


## Основные функуии GitHub:

## 1 - хранение файлов

## 2 - контроль версий файлов

## 3 - упрощенный деплой

## 4 - удобная среда для ревью кода


## mos.hub - это отечественный сайт

## mkdir - создать папку

## cd имя папки - перейти в папку

## git --version - посмотреть версию Git (git version 2.46.2.windows.1)

## команды для Git - https://git-scm.com/docs

## git init - инициировать проект

## git status - команда статус

## стрелочка вверх - позволяет повторить предыдущую команду

## git add (имя файла)(.) - для того чтобы добавить в отслеживаемые, если точка, то добавяться все файлы с папки

## git rm --cached (имя файла) - для того чтобы убрать из отслеживаемых

## git config --global user.name (имя) - задать имя пользователя

## git config --global user.email andreykadmx@mail.ru - задать адрес эл. почты

## git config --global --list - проверить задалось ли имя и почта

##  ssh-keygen - создать пупличный ключ для привязки аккаунта

##  ssh -T git@github.com - инициализирует подключение к репозиторию

## git remove -v - команда проверки предоставлен ли доступ

##  git remote add origin(ссылка на проект с хаба) - подключение по ссылке на проект
##
##
##
##
##